function sum(num1, num2){
    var result = num1 + num2;
    console.log(result);
    // console.log(result);
}
sum(20, 10)

✅ গ্লোবাল স্কোপ → পুরো স্ক্রিপ্টে অ্যাক্সেসযোগ্য।
✅ ব্লক স্কোপ → {} ব্র্যাকেটের মধ্যে সীমাবদ্ধ।
✅ var → ফাংশন স্কোপ ফলো করে, কিন্তু ব্লক স্কোপ ফলো করে না।
✅ let & const → ব্লক স্কোপ ফলো করে।




JavaScript-এ scope বলতে বোঝানো হয় একটি ভেরিয়েবল কোথা থেকে অ্যাক্সেস করা যাবে বা তার accessibility। স্কোপ মূলত দুই ধরনের হয়:

১. গ্লোবাল স্কোপ (Global Scope)
যখন কোনো ভেরিয়েবল script বা program-এর বাইরে ঘোষণা করা হয় অথবা var কীওয়ার্ড দিয়ে ফাংশনের বাইরে ডিক্লেয়ার করা হয়, তখন সেটি গ্লোবাল স্কোপ ধারণ করে।

🔹 গ্লোবাল ভেরিয়েবলকে স্ক্রিপ্টের যেকোনো অংশে ব্যবহার করা যায়।